In [1]:
import pandas as pd
import numpy as np

In [7]:
df1 = pd.read_csv('sample_sets/merge_long+wise_form.csv')

In [8]:
df2 = pd.read_csv('sample_sets/merge_long2.csv')

In [9]:
df1

   PART#  MY_QTY  MY_PRC
0  Item1       1      20
1  Item1      10      18
2  Item1      20      17
3  Item2       1     120
4  Item2      30     100
5  Item2      50      95

In [5]:
df2

   PART#  VEND#  QTY1  PRC1  QTY2  PRC2  QTY3  PRC3  Unnamed: 8
0  Item1  Vend1     1    10     5     8  15.0   7.0         NaN
1  Item1  Vend2     1    15    11    12  30.0  11.0         NaN
2  Item1  Vend3     1    20    10    18   NaN   NaN         NaN
3  Item2  Vend1     1    75    20    60  30.0  55.0         NaN
4  Item2  Vend2     1    80    12    70   NaN   NaN         NaN

In [ ]:
pd.pivot_table(df2, index='PART#', columns='VEND#', values=['PRC1','PRC2','PRC3'])

In [ ]:
dfs = []
for val in ['PRC1','PRC2','PRC3']:    
    temp = pd.pivot_table(df2, index='PART#', columns='VEND#', values=val).reset_index()
    dfs.append(temp)

In [ ]:
dfs

In [ ]:
df = pd.concat(dfs, axis=0)

In [ ]:
df

In [ ]:
df1.join(df.sort_values('PART#').reset_index(), lsuffix='PART#', how='inner')

In [1]:
import pandas as pd
data = [('a1', 'b1', 1, 2),
        ('a1', 'b2', 3, 4),
        ('a1', 'b3', 5, 6),
        ('a2', 'b1', 7, 8),
        ('a2', 'b2', 9, 10),
        ('a2', 'b3', 11, 12)]

df = pd.DataFrame(data, columns=['A', 'B', 'X', 'Y'])

In [2]:
df

    A   B   X   Y
0  a1  b1   1   2
1  a1  b2   3   4
2  a1  b3   5   6
3  a2  b1   7   8
4  a2  b2   9  10
5  a2  b3  11  12

In [9]:
pd.pivot_table(df, index='A',columns='B', values=['X','Y']).swaplevel(axis=1).sort_index(axis=1)

B  b1    b2      b3
    X  Y  X   Y   X   Y
A
a1  1  2  3   4   5   6
a2  7  8  9  10  11  12

In [3]:
raw_data = {
        'subject_id': ['1', '2', '3', '4', '5'],
        'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'], 
        'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']}
df_a = pd.DataFrame(raw_data, columns = ['subject_id', 'first_name', 'last_name'])

In [5]:
df_a

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches

In [10]:
df_a.loc[(df_a['subject_id'] == '2') & (df_a['first_name'] == 'Amy'),'outcome']=2

In [9]:
df_a['subject_id'] == '2'

0    False
1     True
2    False
3    False
4    False
Name: subject_id, dtype: bool

In [11]:
df_a

  subject_id first_name last_name  outcome
0          1       Alex  Anderson      NaN
1          2        Amy  Ackerman      2.0
2          3      Allen       Ali      NaN
3          4      Alice      Aoni      NaN
4          5     Ayoung   Atiches      NaN

In [14]:
df = pd.read_csv('sample_sets/ranked.csv')

In [15]:
df

    GROUP   BEHAVIOR SUBBEHAVIOR  PERCENT  INDEX
0  GROUP1  behavior1         foo    0.521    123
1  GROUP1  behavior2         bar    0.013    213
2  GROUP1  behavior2        fuzz    1.034    103
3  GROUP1  behavior3      foobar    0.750    131
4  GROUP2  behavior1         foo    1.521    101
5  GROUP2  behavior2         bar    0.913     91
6  GROUP2  behavior2        fuzz    0.034    301
7  GROUP2  behavior3      foobar    0.950     87

In [20]:
df.join(df.loc[df['PERCENT']>0.05].groupby('GROUP')['INDEX'].rank(ascending=False).rename('RANK'))

    GROUP   BEHAVIOR SUBBEHAVIOR  PERCENT  INDEX  RANK
0  GROUP1  behavior1         foo    0.521    123   2.0
1  GROUP1  behavior2         bar    0.013    213   NaN
2  GROUP1  behavior2        fuzz    1.034    103   3.0
3  GROUP1  behavior3      foobar    0.750    131   1.0
4  GROUP2  behavior1         foo    1.521    101   1.0
5  GROUP2  behavior2         bar    0.913     91   2.0
6  GROUP2  behavior2        fuzz    0.034    301   NaN
7  GROUP2  behavior3      foobar    0.950     87   3.0

In [2]:
a=1
b=2
c=3

In [3]:
a,b,c

(1, 2, 3)

In [4]:
who

a	 b	 c	 np	 pd

In [5]:
whos

Variable   Type      Data/Info
------------------------------
a          int       1
b          int       2
c          int       3
np         module    <module 'numpy' from '/us<...>ages/numpy/__init__.pyc'>
pd         module    <module 'pandas' from '/u<...>ges/pandas/__init__.pyc'>

In [6]:
locals()

{'In': ['',
  u'import pandas as pd\nimport numpy as np',
  u'a=1\nb=2\nc=3',
  u'a,b,c',
  u"get_ipython().magic(u'who ')",
  u"get_ipython().magic(u'whos ')",
  u'locals()'],
 'Out': {3: (1, 2, 3)},
 '_': (1, 2, 3),
 '_3': (1, 2, 3),
 '__': '',
 '___': '',
 '__builtin__': <module '__builtin__' (built-in)>,
 '__builtins__': <module '__builtin__' (built-in)>,
 '__doc__': 'Automatically created module for IPython interactive environment',
 '__name__': '__main__',
 '__package__': None,
 '_dh': [u'/Users/WiseYale/Desktop/LearnPython/Yale_Skrimps/stack_questions'],
 '_i': u'whos',
 '_i1': u'import pandas as pd\nimport numpy as np',
 '_i2': u'a=1\nb=2\nc=3',
 '_i3': u'a,b,c',
 '_i4': u'who',
 '_i5': u'whos',
 '_i6': u'locals()',
 '_ih': ['',
  u'import pandas as pd\nimport numpy as np',
  u'a=1\nb=2\nc=3',
  u'a,b,c',
  u"get_ipython().magic(u'who ')",
  u"get_ipython().magic(u'whos ')",
  u'locals()'],
 '_ii': u'who',
 '_iii': u'a,b,c',
 '_oh': {3: (1, 2, 3)},
 '_sh': <module 'IPython.core.shadowns' from '/usr/local/lib/python2.7/site-packages/IPython/core/shadowns.pyc'>,
 'a': 1,
 'b': 2,
 'c': 3,
 'exit': <IPython.core.autocall.ZMQExitAutocall at 0x109239490>,
 'get_ipython': <bound method ZMQInteractiveShell.get_ipython of <ipykernel.zmqshell.ZMQInteractiveShell object at 0x108669950>>,
 'np': <module 'numpy' from '/usr/local/lib/python2.7/site-packages/numpy/__init__.pyc'>,
 'pd': <module 'pandas' from '/usr/local/lib/python2.7/site-packages/pandas/__init__.pyc'>,
 'quit': <IPython.core.autocall.ZMQExitAutocall at 0x109239490>}